In [4]:
import pandas as pd
import time

In [9]:
data = pd.read_csv('/home/prashant/Downloads/ABC.csv')

In [10]:
data.head()

   app_id         status  lenderid          date
0  103673  UNINITIALIZED       182  1.539773e+12
1  104524  UNINITIALIZED       182  1.540025e+12
2  104674  UNINITIALIZED       182  1.539937e+12
3  106730  UNINITIALIZED       182  1.540280e+12
4  107030  UNINITIALIZED       182  1.540559e+12

In [11]:
data.date = pd.to_datetime(data.date, unit='ms')

In [12]:
data.date = data.date + pd.Timedelta(hours=5, minutes=30)

In [13]:
data.date = data.date.dt.date

In [14]:
data.head()

   app_id         status  lenderid        date
0  103673  UNINITIALIZED       182  2018-10-17
1  104524  UNINITIALIZED       182  2018-10-20
2  104674  UNINITIALIZED       182  2018-10-19
3  106730  UNINITIALIZED       182  2018-10-23
4  107030  UNINITIALIZED       182  2018-10-26

In [15]:
data.to_csv('/home/prashant/Downloads/UNINITIALIZED_DMI.csv')

In [10]:
# data = data['prashant']

Date to Milisecons

In [2]:
dim = pd.read_csv('/home/prashant/Downloads/UAT_writtenOff.csv')

In [3]:
dim

   loan_id  application_id  lender_id  written_off_amt written_off_date
0      354             542        179             2563       12-09-2018
1      254             462        179             1256       05-11-2018

In [5]:
dim.written_off_date = pd.Timestamp(dim.written_off_date)
time.mktime(dim.written_off_date.timetuple())

TypeError: Cannot convert input [0    12-09-2018
1    05-11-2018
Name: written_off_date, dtype: object] of type <class 'pandas.core.series.Series'> to Timestamp